toasterllc/MDCCode/Code/STM32/STApp/Source/main.cpp
    // Task stack
    [[gnu::section(".stack._TaskUSBDataOut")]]
    static inline uint8_t Stack[256];
};

// _TaskUSBDataIn: writes buffers from _Bufs to the DataIn endpoint, and pops them from _Bufs
struct _TaskUSBDataIn {
    static void Start() {
        _Scheduler::Start<_TaskUSBDataIn>([] {
            for (;;) {
                _Scheduler::Wait([] { return _Bufs.rok(); });
                
                // Send the data and wait until the transfer is complete
                auto& buf = _Bufs.rget();
                _USB.send(Endpoints::DataIn, buf.data, buf.len);
                _Scheduler::Wait([] { return _USB.endpointReady(Endpoints::DataIn); });
                
                buf.len = 0;
                _Bufs.rpop();
            }
        });
    }
    
    // Task options
    static constexpr Toastbox::TaskOptions Options{};
    
    // Task stack
    [[gnu::section(".stack._TaskUSBDataIn")]]
    static inline uint8_t Stack[256];
};

// _TaskReadout:
struct _TaskReadout {
    using Clk = GPIO<GPIOPortB, GPIO_PIN_2>; // AF9
    using D0 = GPIO<GPIOPortF, GPIO_PIN_8>;  // AF10
    using D1 = GPIO<GPIOPortF, GPIO_PIN_9>;  // AF10
    using D2 = GPIO<GPIOPortF, GPIO_PIN_7>;  // AF9
    using D3 = GPIO<GPIOPortF, GPIO_PIN_6>;  // AF9
    using D4 = GPIO<GPIOPortE, GPIO_PIN_7>;  // AF10
    using D5 = GPIO<GPIOPortE, GPIO_PIN_8>;  // AF10
    using D6 = GPIO<GPIOPortE, GPIO_PIN_9>;  // AF10
    using D7 = GPIO<GPIOPortE, GPIO_PIN_10>; // AF10
    
    static uint8_t ReadByte() {
        return (((uint8_t)D7::Read()) << 7) |
               (((uint8_t)D6::Read()) << 6) |
               (((uint8_t)D5::Read()) << 5) |
               (((uint8_t)D4::Read()) << 4) |
               (((uint8_t)D3::Read()) << 3) |
               (((uint8_t)D2::Read()) << 2) |
               (((uint8_t)D1::Read()) << 1) |
               (((uint8_t)D0::Read()) << 0) ;
    }
    
    static void Start(std::optional<size_t> len) {
        static std::optional<size_t> remLen;
        remLen = len;
        
        _Scheduler::Start<_TaskReadout>([] {
            // Reset state
            _Bufs.reset();
            // Start the USB DataIn task
            _TaskUSBDataIn::Start();
            
            // Send the Readout message, which causes us to enter the readout mode until
            // we release the chip select
            _ICE_ST_SPI_CS_::Write(0);
            _QSPI.command(_QSPICmd::ICEApp(_ICE::ReadoutMsg(), 0));
            
            Clk::Write(0);
            Clk::Config(GPIO_MODE_OUTPUT_PP, GPIO_NOPULL, GPIO_SPEED_FREQ_VERY_HIGH, 0);
            
            D0::Config(GPIO_MODE_INPUT, GPIO_NOPULL, GPIO_SPEED_FREQ_VERY_HIGH, 0);
            D1::Config(GPIO_MODE_INPUT, GPIO_NOPULL, GPIO_SPEED_FREQ_VERY_HIGH, 0);
            D2::Config(GPIO_MODE_INPUT, GPIO_NOPULL, GPIO_SPEED_FREQ_VERY_HIGH, 0);
            D3::Config(GPIO_MODE_INPUT, GPIO_NOPULL, GPIO_SPEED_FREQ_VERY_HIGH, 0);
            D4::Config(GPIO_MODE_INPUT, GPIO_NOPULL, GPIO_SPEED_FREQ_VERY_HIGH, 0);
            D5::Config(GPIO_MODE_INPUT, GPIO_NOPULL, GPIO_SPEED_FREQ_VERY_HIGH, 0);
            D6::Config(GPIO_MODE_INPUT, GPIO_NOPULL, GPIO_SPEED_FREQ_VERY_HIGH, 0);
            D7::Config(GPIO_MODE_INPUT, GPIO_NOPULL, GPIO_SPEED_FREQ_VERY_HIGH, 0);
            
            // Read data over QSPI and write it to USB, indefinitely
            for (;;) {
                // Wait until: there's an available buffer, QSPI is ready, and ICE40 says data is available
                _Scheduler::Wait([] { return _Bufs.wok() && _QSPI.ready(); });
                
                const size_t len = std::min(remLen.value_or(SIZE_MAX), _ICE::ReadoutMsg::ReadoutLen);
                auto& buf = _Bufs.wget();
                
                // If there's no more data to read, bail
                if (!len) {
                    // Before bailing, push the final buffer if it holds data
                    if (buf.len) _Bufs.wpush();
                    break;
                }
                
                // If we can't read any more data into the producer buffer,
                // push it so the data will be sent over USB
                if (sizeof(buf.data)-buf.len < len) {
                    _Bufs.wpush();
                    continue;
                }
                
                // Wait until ICE40 signals that data is ready to be read
                #warning TODO: we should institute yield after some number of retries to avoid crashing the system if we never get data
                while (!_ICE_ST_SPI_D_READY::Read());
                
                _Scheduler::Sleep(_Scheduler::Ms(1000));
                
                // 8 dummy cycles
                for (uint32_t i=0; i<8; i++) {
                    Clk::Write(1);
                    Clk::Write(0);
                }
                
                for (uint32_t i=0; i<_ICE::ReadoutMsg::ReadoutLen; i++) {
                    buf.data[buf.len] = ReadByte();
                    buf.len++;
                    
                    Clk::Write(1);
                    Clk::Write(0);
                }
                
                _Bufs.wpush();
                
                if (remLen) *remLen -= len;
            }
        });
    }
    
    static void DidStop() {
        // De-assert the SPI chip select when the _TaskReadout is stopped.
        // This is necessary because the _TaskReadout asserts the SPI chip select,
        // but never deasserts it because _TaskReadout continues indefinitely.
        _ICE_ST_SPI_CS_::Write(1);
    }
    
    // Task options
    static constexpr Toastbox::TaskOptions Options{
        .DidStop = DidStop,
    };
    
    // Task stack
    [[gnu::section(".stack._TaskReadout")]]
    static inline uint8_t Stack[512];
};

// MARK: - Commands

static void _HostModeInit(const STM::Cmd& cmd) {
    // Accept command
    _System::USBAcceptCommand(true);
    
    const auto mspr = _MSP.connect();
    
    // Send status
    _System::USBSendStatus(mspr == _MSP.Status::OK);
}

static void _HostModeEnter(const STM::Cmd& cmd) {
    auto& arg = cmd.arg.HostModeEnter;
    
    // Accept command
    _System::USBAcceptCommand(true);
    
    // Configure QSPI for comms with ICEApp
    _QSPISetConfig(_QSPIConfigs.ICEApp);
    
